# specify a directory to install
cask_args appdir: '/Applications'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'rbenv'
brew 'tree'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'

brew 'vim'
brew 'autojump'

brew 'nvm'
brew 'yarn'

brew 'diff-so-fancy'
brew 'the_silver_searcher'

brew 'postgresql@9.6', restart_service: true
brew 'rabbitmq', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'
brew 'mongodb'
brew 'mysql'

brew 'erlang'
brew 'elixir'

brew 'go'

brew 'libpng'
brew 'jpeg'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'ffmpeg'
brew 'libtool'
brew 'readline'
brew 'webp'
brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-webp']
brew 'libssh'
brew 'libxml2'
brew 'libxslt'
brew 'openjpeg'
brew 'webkit2png'

brew 'cmake'
brew 'coreutils'

brew 'libiconv'
brew 'zlib'

cask 'firefox'
cask 'google-chrome'

cask 'grammarly'
cask 'spectacle'
cask 'muzzle'
cask 'vlc'
cask 'pritunl'
cask 'caffeine'

brew 'mas'
mas 'Keynote', id: 409183694

cask 'skype'
cask 'slack'

cask 'licecap'
cask 'iterm2'
cask 'insomnia'
cask 'sublime-text'
cask 'sequel-pro'
cask 'postico'
cask 'docker'
cask 'visual-studio-code'

cask 'spotify'

tap 'caskroom/fonts'
cask 'font-source-code-pro'
