# specify a directory to install
cask_args appdir: '/Applications'

brew 'bash'
brew 'bash-completion'
brew 'rbenv'
brew 'tree'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'

brew 'vim'
brew 'autojump'

brew 'nvm'
brew 'asdf'

brew 'libpng'
brew 'jpeg'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'ffmpeg'
brew 'libtool'
brew 'readline'
brew 'webp'
brew 'libssh'
brew 'libxml2'
brew 'libxslt'
brew 'openjpeg'
brew 'webkit2png'

brew 'cmake'
brew 'coreutils'

brew 'libiconv'
brew 'zlib'

cask 'spectacle'
cask 'vlc'
cask 'caffeine'

cask 'slack'

cask 'licecap'
cask 'iterm2'
cask 'insomnia'
cask 'postico'
cask 'docker'
cask 'visual-studio-code'

cask 'spotify'

tap 'caskroom/fonts'
cask 'font-source-code-pro'
